<a href="https://colab.research.google.com/github/anish2245/Python-DataScience/blob/main/Pandas_tutorial_Guvi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [3]:
arr=np.random.randint(0,10,(5,3))
arr

array([[2, 9, 6],
       [9, 8, 9],
       [1, 4, 9],
       [6, 6, 2],
       [6, 2, 1]])

In [6]:
df=pd.DataFrame(arr)
df

   0  1  2
0  2  9  6
1  9  8  9
2  1  4  9
3  6  6  2
4  6  2  1

In [8]:
df.values

array([[2, 9, 6],
       [9, 8, 9],
       [1, 4, 9],
       [6, 6, 2],
       [6, 2, 1]])

We can interate and find any value from the index

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.columns

RangeIndex(start=0, stop=3, step=1)

Accessing the rows

In [15]:
df.values[0]

array([2, 9, 6])

Givinf userdefined names to the rows and columns

In [16]:
df.index=['R1','R2','R3','R4','R5']
df.columns=['C1','C2','C3']

In [20]:
df

    C1  C2  C3
R1   2   9   6
R2   9   8   9
R3   1   4   9
R4   6   6   2
R5   6   2   1

Accessing partivular data using loc method Explicit method

In [23]:
df.loc['R1']['C2']

9

Accessing using the Implicit method using iloc (rows and columns)

In [25]:
df.iloc[0,1]

9

We are accessing a subset of a dataFrame using iloc

In [27]:
df.iloc[2:4,1:3]

    C2  C3
R3   4   9
R4   6   2

In [29]:
df.loc['R3':'R5','C2':'C3']

    C2  C3
R3   4   9
R4   6   2
R5   2   1

In [31]:
df

    C1  C2  C3
R1   2   9   6
R2   9   8   9
R3   1   4   9
R4   6   6   2
R5   6   2   1

We are getting a series from the dataframe using iloc for the row

In [36]:
df.iloc[0]

C1    2
C2    9
C3    6
Name: R1, dtype: int64

We are getting a series from the dataframe using iloc for the columns

In [38]:
df.iloc[:,0]

R1    2
R2    9
R3    1
R4    6
R5    6
Name: C1, dtype: int64

CREATING A FUNCTION WITH ROWS AND COLUMNS FOR CREATING A DATAFRAME

In [44]:
def create_df(nRows,nColumns):
  arr=np.random.randint(0,10,(nRows,nColumns))
  df=pd.DataFrame(arr)
  df.index=['R'+ str(x) for x in np.arange(1,nRows+1)]
  df.columns=['C' +str(x) for x in np.arange(1,nColumns+1)]
  return df
create_df(5,3)

    C1  C2  C3
R1   3   6   0
R2   0   9   0
R3   8   9   7
R4   0   4   7
R5   9   2   5

In [46]:
mass=pd.Series([0.33,4.87,5.97,0.642,1898,568,86.8,102,0.0146],index=['mercury','venus','earth','mars','jupiter','saturn','uranus','neptune','pluto'])
mass

mercury       0.3300
venus         4.8700
earth         5.9700
mars          0.6420
jupiter    1898.0000
saturn      568.0000
uranus       86.8000
neptune     102.0000
pluto         0.0146
dtype: float64

In [48]:
diameter=pd.Series([4879,12104,12756,3475,6792,142984,120536,51118,49528,2370],index=['mercury','venus','earth','moon','mars','jupiter','saturn','uranus','neptune','pluto',])
diameter

mercury      4879
venus       12104
earth       12756
moon         3475
mars         6792
jupiter    142984
saturn     120536
uranus      51118
neptune     49528
pluto        2370
dtype: int64

We are having two series with float and int , to convert it to a Dataframe

In [51]:
df=pd.DataFrame({"Mass":mass,"Diameter":diameter})
df

              Mass  Diameter
earth       5.9700     12756
jupiter  1898.0000    142984
mars        0.6420      6792
mercury     0.3300      4879
moon           NaN      3475
neptune   102.0000     49528
pluto       0.0146      2370
saturn    568.0000    120536
uranus     86.8000     51118
venus       4.8700     12104

To access a column in the Dataframe

In [52]:
df['Mass']

earth         5.9700
jupiter    1898.0000
mars          0.6420
mercury       0.3300
moon             NaN
neptune     102.0000
pluto         0.0146
saturn      568.0000
uranus       86.8000
venus         4.8700
Name: Mass, dtype: float64

In [54]:
df['Diameter']

earth       12756
jupiter    142984
mars         6792
mercury      4879
moon         3475
neptune     49528
pluto        2370
saturn     120536
uranus      51118
venus       12104
Name: Diameter, dtype: int64

To access a single element in the dataframe
Always column and then row

In [57]:
df['Mass']['earth']

5.97

To create a new column

In [60]:
df['population']=0
df

              Mass  Diameter  population
earth       5.9700     12756           0
jupiter  1898.0000    142984           0
mars        0.6420      6792           0
mercury     0.3300      4879           0
moon           NaN      3475           0
neptune   102.0000     49528           0
pluto       0.0146      2370           0
saturn    568.0000    120536           0
uranus     86.8000     51118           0
venus       4.8700     12104           0

To add a value to the column mentioned in a special row

In [64]:
df['population']['earth']=8000000000

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [65]:
df

              Mass  Diameter  population
earth       5.9700     12756  8000000000
jupiter  1898.0000    142984           0
mars        0.6420      6792           0
mercury     0.3300      4879           0
moon           NaN      3475           0
neptune   102.0000     49528           0
pluto       0.0146      2370           0
saturn    568.0000    120536           0
uranus     86.8000     51118           0
venus       4.8700     12104           0

to access all rows of mass and diameter

In [67]:
df.loc[:,['Mass','Diameter']]

              Mass  Diameter
earth       5.9700     12756
jupiter  1898.0000    142984
mars        0.6420      6792
mercury     0.3300      4879
moon           NaN      3475
neptune   102.0000     49528
pluto       0.0146      2370
saturn    568.0000    120536
uranus     86.8000     51118
venus       4.8700     12104

Creating a row Called Col_mean which calculates the mean value for all the columns

In [68]:
df.loc['Col_Mean']=0

In [70]:
df

               Mass  Diameter  population
earth        5.9700     12756  8000000000
jupiter   1898.0000    142984           0
mars         0.6420      6792           0
mercury      0.3300      4879           0
moon            NaN      3475           0
neptune    102.0000     49528           0
pluto        0.0146      2370           0
saturn     568.0000    120536           0
uranus      86.8000     51118           0
venus        4.8700     12104           0
Col_Mean     0.0000         0           0

To find the mean of the mass

In [80]:
np.mean(df['Mass'])

266.66266

To delete a row

In [ ]:
df.drop('Col_Mean',inplace=True)

To delete a column axis=1 we should givr

In [ ]:
df.drop('population',axis=1,inplace=True)

In [92]:
df

              Mass  Diameter
earth       5.9700     12756
jupiter  1898.0000    142984
mars        0.6420      6792
mercury     0.3300      4879
moon           NaN      3475
neptune   102.0000     49528
pluto       0.0146      2370
saturn    568.0000    120536
uranus     86.8000     51118
venus       4.8700     12104

In [94]:
np.mean(df['Mass'])

296.29184444444445

To calculate the mean and the diamater for all the values

In [96]:
df.loc['Col_Mean']=[np.mean(df['Mass']),np.mean(df['Diameter'])]

In [98]:
df

                 Mass  Diameter
earth        5.970000   12756.0
jupiter   1898.000000  142984.0
mars         0.642000    6792.0
mercury      0.330000    4879.0
moon              NaN    3475.0
neptune    102.000000   49528.0
pluto        0.014600    2370.0
saturn     568.000000  120536.0
uranus      86.800000   51118.0
venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

In [104]:
df.drop('Col_Mean')

              Mass  Diameter
earth       5.9700   12756.0
jupiter  1898.0000  142984.0
mars        0.6420    6792.0
mercury     0.3300    4879.0
moon           NaN    3475.0
neptune   102.0000   49528.0
pluto       0.0146    2370.0
saturn    568.0000  120536.0
uranus     86.8000   51118.0
venus       4.8700   12104.0

In [112]:
for i in df.columns:
  print(i)
  print(np.mean(df[i]))

Mass
296.29184444444445
Diameter
40654.200000000004

Another way of adding the row using the looping method

In [114]:
def create_mean_row(df):
  df.loc['Col_Mean']=[np.mean(df[col]) for col in df.columns]

In [115]:
df

                 Mass  Diameter
earth        5.970000   12756.0
jupiter   1898.000000  142984.0
mars         0.642000    6792.0
mercury      0.330000    4879.0
moon              NaN    3475.0
neptune    102.000000   49528.0
pluto        0.014600    2370.0
saturn     568.000000  120536.0
uranus      86.800000   51118.0
venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

One more and most used way of adding a row with the full mean value is

In [117]:
df.drop('Col_Mean')

              Mass  Diameter
earth       5.9700   12756.0
jupiter  1898.0000  142984.0
mars        0.6420    6792.0
mercury     0.3300    4879.0
moon           NaN    3475.0
neptune   102.0000   49528.0
pluto       0.0146    2370.0
saturn    568.0000  120536.0
uranus     86.8000   51118.0
venus       4.8700   12104.0

In [120]:
df.loc['Col_Mean']=df.mean()
df

                 Mass  Diameter
earth        5.970000   12756.0
jupiter   1898.000000  142984.0
mars         0.642000    6792.0
mercury      0.330000    4879.0
moon              NaN    3475.0
neptune    102.000000   49528.0
pluto        0.014600    2370.0
saturn     568.000000  120536.0
uranus      86.800000   51118.0
venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

Accessing the old function to get a dataframe

In [123]:
df=create_df(5,3)
df

    C1  C2  C3
R1   7   2   1
R2   9   2   9
R3   6   0   1
R4   9   0   9
R5   5   3   5

Calculates the mean value across each column (Returns a series)

In [125]:
df.mean()

C1    7.2
C2    1.4
C3    5.0
dtype: float64

to calculate the mean values acrosss each row (return a series)

In [127]:
df.mean(axis=1)

R1    3.333333
R2    6.666667
R3    2.333333
R4    6.000000
R5    4.333333
dtype: float64

In [128]:
df

    C1  C2  C3
R1   7   2   1
R2   9   2   9
R3   6   0   1
R4   9   0   9
R5   5   3   5

To create a extra column row_mean with the mean values of the each row

In [130]:
df['Row_Mean']=df.mean(axis=1)
df

    C1  C2  C3  Row_Mean
R1   7   2   1  3.333333
R2   9   2   9  6.666667
R3   6   0   1  2.333333
R4   9   0   9  6.000000
R5   5   3   5  4.333333

to create a columns mean

In [133]:
df.loc['Col_Mean']=df.mean()
df

           C1   C2   C3  Row_Mean
R1        7.0  2.0  1.0  3.333333
R2        9.0  2.0  9.0  6.666667
R3        6.0  0.0  1.0  2.333333
R4        9.0  0.0  9.0  6.000000
R5        5.0  3.0  5.0  4.333333
Col_Mean  7.2  1.4  5.0  4.533333

Medians for the columns

In [135]:
df.median()

C1          7.100000
C2          1.700000
C3          5.000000
Row_Mean    4.433333
dtype: float64

Minimum value for the columns

In [137]:
df.min()

C1          5.000000
C2          0.000000
C3          1.000000
Row_Mean    2.333333
dtype: float64

Max value for the column

In [139]:
df.max()

C1          9.000000
C2          3.000000
C3          9.000000
Row_Mean    6.666667
dtype: float64

o.25 percentage of the columns

In [141]:
df.quantile(0.25)

C1          6.250000
C2          0.350000
C3          2.000000
Row_Mean    3.583333
Name: 0.25, dtype: float64

To delete the row mean

In [142]:
df.drop("Row_Mean",axis=1)

           C1   C2   C3
R1        7.0  2.0  1.0
R2        9.0  2.0  9.0
R3        6.0  0.0  1.0
R4        9.0  0.0  9.0
R5        5.0  3.0  5.0
Col_Mean  7.2  1.4  5.0

In [144]:
df.describe()

         C1    C2        C3  Row_Mean
count  6.00  6.00  6.000000  6.000000
mean   7.20  1.40  5.000000  4.533333
std    1.60  1.20  3.577709  1.613829
min    5.00  0.00  1.000000  2.333333
25%    6.25  0.35  2.000000  3.583333
50%    7.10  1.70  5.000000  4.433333
75%    8.55  2.00  8.000000  5.633333
max    9.00  3.00  9.000000  6.666667

In [146]:
mass=pd.Series([0.33,4.87,5.97,0.642,1898,568,86.8,102,0.0146],index=['mercury','venus','earth','mars','jupiter','saturn','uranus','neptune','pluto'])
mass
diameter=pd.Series([4879,12104,12756,3475,6792,142984,120536,51118,49528,2370],index=['mercury','venus','earth','moon','mars','jupiter','saturn','uranus','neptune','pluto',])
diameter

mercury      4879
venus       12104
earth       12756
moon         3475
mars         6792
jupiter    142984
saturn     120536
uranus      51118
neptune     49528
pluto        2370
dtype: int64

In [148]:
planets=pd.DataFrame({"mass":mass,"diameter":diameter})
planets

              mass  diameter
earth       5.9700     12756
jupiter  1898.0000    142984
mars        0.6420      6792
mercury     0.3300      4879
moon           NaN      3475
neptune   102.0000     49528
pluto       0.0146      2370
saturn    568.0000    120536
uranus     86.8000     51118
venus       4.8700     12104

In [150]:
planets.describe()

              mass      diameter
count     9.000000      10.00000
mean    296.291844   40654.20000
std     627.786429   51541.39142
min       0.014600    2370.00000
25%       0.642000    5357.25000
50%       5.970000   12430.00000
75%     102.000000   50720.50000
max    1898.000000  142984.00000

Loading a df from 3rd party

In [173]:
import seaborn as sns

In [213]:
df=sns.load_dataset('planets')

info method shows the details about the dataset

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [167]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [176]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

Go through each row of the dataframe and delete it(drop) if the coulmn is null

In [170]:
for r in df.index:
  for c in df.columns:
    if pd.isnull(df.loc[r,c]):
      df.drop(r,inplace=True)
      break

now the empty values have been removed

In [172]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

Another way of removing the rows which have empty data is using iterrows

In [179]:
for i,c in df.iterrows():
  print(i)
  print(c)
  break

0
method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

using iterrows we can get the index and each of the row and any funtion returns if anyone of the part is true

In [192]:
for i,r in df.iterrows():
  if pd.isnull(r).any():
    df.drop(i,inplace=True)

In [196]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

One more way for deleting the null values in the dataframe

In [201]:
df.dropna(inplace=True)

In [203]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

Filter and show only those rows which have planets that are found in the 2010's and the method is RADIAL VELOCITY and Transit and distance is greater than 75 percentile

In [232]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

to check it for 75 percentage

In [233]:
per_75=df.distance.quantile(0.75)

In [234]:
df_=df.copy()
df_=df_[
   (df_['year']>=2010) &
   ((df_['method']=='Radial Velocity') | (df_['method']=='Transit')) &
   (df_['distance'] >per_75)
]

In [235]:
df_.describe()

           number  orbital_period       mass     distance         year
count  154.000000      154.000000   7.000000   154.000000   154.000000
mean     2.045455       55.483100   5.207143   654.435649  2011.448052
std      1.834103      159.178501   3.891918   527.480906     1.078865
min      1.000000        0.742960   1.250000   180.000000  2010.000000
25%      1.000000        3.276083   2.450000   303.000000  2011.000000
50%      1.000000        4.641130   4.000000   429.000000  2011.000000
75%      2.000000       16.228912   7.600000   800.000000  2012.000000
max      7.000000     1022.000000  11.100000  3200.000000  2014.000000

In [231]:
df_.head()

      method  number  orbital_period  mass  distance  year
99   Transit       1        6.212290   NaN     380.0  2010
101  Transit       1       13.240600   NaN     345.0  2010
102  Transit       1        2.994330   NaN     560.0  2010
103  Transit       1        2.828042   NaN    1150.0  2010
104  Transit       1        4.035190   NaN    1060.0  2010